# CurveUV Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveUV Class
Members See Also
---
A class that encapsulates the notion of a curve in the 2D parameter space of a surface in 3D space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class CurveUV : IDisposable
```

Visual Basic
---
```text
Public Class CurveUV _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CurveUV : IDisposable
```

# Remarks
Revit does not have a class to represent 2D curves explicitly.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CurveUV
# See Also
CurveUV Members
Autodesk.Revit.DB Namespace